#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/wyatt-prod/wyatt-prod/runs/run-ZkFxFMfraYQdPqhL

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ade32e18bf1abe67]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0324545d007dbc5d3]
module.vpc.aws_egress_only_internet_gateway.this[0]: Refreshing state... [id=eigw-0a1e0c01a099823a8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0af90f8fbd455b50a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-057a7f8016f47f604]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-09e48960d63dfd1ba]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-049c2c6ca90c64e74]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-072d9e7b5e931ec4d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c7c1353e4bb5f72c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05e3f9c6b4f80f8a7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0217788f2c049f848]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03f15b1f46a5b8d40]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0db54b4bb2b07bc45]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0feb00250f24b9f45]
module.vpc.aws_route.public_internet_gateway_ipv6[0]: Refreshing state... [id=r-rtb-049c2c6ca90c64e742750132062]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-049c2c6ca90c64e741080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-05bdeff19c600a6b0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07bbd5c97e1cdd779]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b4826ffd99b1309a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-049c2c6ca90c64e74"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0db54b4bb2b07bc45"
              + instance_id                = ""
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0db54b4bb2b07bc45"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "wyatt-vpc-public"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
      + arn              = "arn:aws:ec2:us-east-2:761551243560:route-table/rtb-0af90f8fbd455b50a"
        id               = "rtb-0af90f8fbd455b50a"
      + owner_id         = "761551243560"
        tags             = {
            "Name" = "wyatt-vpc-private-us-east-2a"
        }
        # (4 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_route.private_ipv6_egress[0] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = "eigw-0a1e0c01a099823a8"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.vpc.aws_route.private_ipv6_egress[1] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = "eigw-0a1e0c01a099823a8"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.vpc.aws_route.private_ipv6_egress[2] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = "eigw-0a1e0c01a099823a8"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] is tainted, so must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-2:761551243560:route-table/rtb-0af90f8fbd455b50a" -> (known after apply)
      ~ id               = "rtb-0af90f8fbd455b50a" -> (known after apply)
      ~ owner_id         = "761551243560" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
      ~ tags             = {
          ~ "Name" = "wyatt-vpc-private-us-east-2a" -> "wyatt-vpc-private"
        }
      ~ tags_all         = {
          ~ "Name" = "wyatt-vpc-private-us-east-2a" -> "wyatt-vpc-private"
        }
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:761551243560:route-table/rtb-057a7f8016f47f604" -> null
      - id               = "rtb-057a7f8016f47f604" -> null
      - owner_id         = "761551243560" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "wyatt-vpc-private-us-east-2b"
        } -> null
      - tags_all         = {
          - "Name" = "wyatt-vpc-private-us-east-2b"
        } -> null
      - vpc_id           = "vpc-0ade32e18bf1abe67" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:761551243560:route-table/rtb-09e48960d63dfd1ba" -> null
      - id               = "rtb-09e48960d63dfd1ba" -> null
      - owner_id         = "761551243560" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "wyatt-vpc-private-us-east-2c"
        } -> null
      - tags_all         = {
          - "Name" = "wyatt-vpc-private-us-east-2c"
        } -> null
      - vpc_id           = "vpc-0ade32e18bf1abe67" -> null
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03f15b1f46a5b8d40"
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0feb00250f24b9f45"
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0217788f2c049f848"
    }

  # module.vpc.aws_vpn_gateway.this[0] will be destroyed
  - resource "aws_vpn_gateway" "this" {
      - amazon_side_asn = "64512" -> null
      - arn             = "arn:aws:ec2:us-east-2:761551243560:vpn-gateway/vgw-0324545d007dbc5d3" -> null
      - id              = "vgw-0324545d007dbc5d3" -> null
      - tags            = {
          - "Name" = "wyatt-vpc"
        } -> null
      - tags_all        = {
          - "Name" = "wyatt-vpc"
        } -> null
      - vpc_id          = "vpc-0ade32e18bf1abe67" -> null
    }

Plan: 7 to add, 0 to change, 4 to destroy.


```

</details>

*Pusher: @wmjones, Action: `pull_request`*